---
kind: property
id: P:Autodesk.Revit.DB.TessellatedBuildIssue.NumberEncountered
source: html/a7f8c71f-786c-ce0a-29d5-71cc33cd060f.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssue.NumberEncountered Property

How many times this issue was encountered in its face set
 during the face set processing. This number can be less
 than the total number of such issues in the face set, as
 the face set processing could be aborted due to
 the presence of the issues which could not be handled.

## Syntax (C#)
```csharp
public int NumberEncountered { get; }
```